artillery-tests/reports/end-to-end-moderate-load.txt
--------------------------------
Summary report @ 18:10:50(+0000)
--------------------------------

http.codes.200: ................................................................ 1620
http.codes.201: ................................................................ 720
http.codes.204: ................................................................ 360
http.downloaded_bytes: ......................................................... 135318
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 2700
http.response_time:
  min: ......................................................................... 33
  max: ......................................................................... 8058
  median: ...................................................................... 247.2
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 6064.7
http.responses: ................................................................ 2700
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 180
plugins.metrics-by-endpoint.DELETE /house/:houseID/question/:questionID.code...  180
plugins.metrics-by-endpoint.DELETE /house/:houseID/rental/:rentalID.codes.204: . 180
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 180
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 180
plugins.metrics-by-endpoint.GET /house/:houseID/question/:questionID.codes.200:  180
plugins.metrics-by-endpoint.GET /user/:userID.codes.200: ....................... 180
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 180
plugins.metrics-by-endpoint.POST /house/:houseID/question.codes.201: ........... 180
plugins.metrics-by-endpoint.POST /house/:houseID/rental/:rentalID.codes.201: ... 180
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 180
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 180
plugins.metrics-by-endpoint.PUT /house.codes.200: .............................. 180
plugins.metrics-by-endpoint.PUT /house/:houseID/rental/:rentalID.codes.200: .... 180
plugins.metrics-by-endpoint.PUT /user/:userID.codes.200: ....................... 180
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 63
  max: ......................................................................... 7245
  median: ...................................................................... 550.1
  p95: ......................................................................... 5598.4
  p99: ......................................................................... 6569.8
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID/question/:questionID:
  min: ......................................................................... 64
  max: ......................................................................... 6921
  median: ...................................................................... 368.8
  p95: ......................................................................... 4676.2
  p99: ......................................................................... 5168
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID/rental/:rentalID:
  min: ......................................................................... 65
  max: ......................................................................... 2595
  median: ...................................................................... 290.1
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 2416.8
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 79
  max: ......................................................................... 8058
  median: ...................................................................... 1274.3
  p95: ......................................................................... 6064.7
  p99: ......................................................................... 6838
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 40
  max: ......................................................................... 443
  median: ...................................................................... 51.9
  p95: ......................................................................... 262.5
  p99: ......................................................................... 432.7
plugins.metrics-by-endpoint.response_time.GET /house/:houseID/question/:questionID:
  min: ......................................................................... 33
  max: ......................................................................... 445
  median: ...................................................................... 51.9
  p95: ......................................................................... 262.5
  p99: ......................................................................... 432.7
plugins.metrics-by-endpoint.response_time.GET /user/:userID:
  min: ......................................................................... 33
  max: ......................................................................... 431
  median: ...................................................................... 57.4
  p95: ......................................................................... 262.5
  p99: ......................................................................... 424.2
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 56
  max: ......................................................................... 6381
  median: ...................................................................... 713.5
  p95: ......................................................................... 5272.4
  p99: ......................................................................... 5711.5
plugins.metrics-by-endpoint.response_time.POST /house/:houseID/question:
  min: ......................................................................... 64
  max: ......................................................................... 6879
  median: ...................................................................... 262.5
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 5378.9
plugins.metrics-by-endpoint.response_time.POST /house/:houseID/rental/:rentalID:
  min: ......................................................................... 80
  max: ......................................................................... 7330
  median: ...................................................................... 1200.1
  p95: ......................................................................... 5487.5
  p99: ......................................................................... 7117
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 66
  max: ......................................................................... 2074
  median: ...................................................................... 301.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1652.8
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 68
  max: ......................................................................... 1182
  median: ...................................................................... 149.9
  p95: ......................................................................... 572.6
  p99: ......................................................................... 982.6
plugins.metrics-by-endpoint.response_time.PUT /house:
  min: ......................................................................... 73
  max: ......................................................................... 7360
  median: ...................................................................... 713.5
  p95: ......................................................................... 3984.7
  p99: ......................................................................... 5711.5
plugins.metrics-by-endpoint.response_time.PUT /house/:houseID/rental/:rentalID:
  min: ......................................................................... 58
  max: ......................................................................... 2165
  median: ...................................................................... 301.9
  p95: ......................................................................... 1408.4
  p99: ......................................................................... 1790.4
plugins.metrics-by-endpoint.response_time.PUT /user/:userID:
  min: ......................................................................... 72
  max: ......................................................................... 1797
  median: ...................................................................... 257.3
  p95: ......................................................................... 925.4
  p99: ......................................................................... 1408.4
vusers.completed: .............................................................. 180
vusers.created: ................................................................ 180
vusers.created_by_name.End to end: ............................................. 180
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1723.8
  max: ......................................................................... 25584.8
  median: ...................................................................... 15218.6
  p95: ......................................................................... 23162.4
  p99: ......................................................................... 25091.6